IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MPU_L2OCRAM_BANK3_MPU_L2OCRAM_BANK3.xml
<module name="MPU_L2OCRAM_BANK3_MPU_L2OCRAM_BANK3" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MPU_L2OCRAM_BANK3_REVISION" acronym="MPU_L2OCRAM_BANK3_REVISION" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme." range="31 - 30" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="Always read a s0. Writes have no affect." range="29 - 28" rwaccess="RO"/> 
		<bitfield id="MODID" width="12" begin="27" end="16" resetval="0x3713" description="Module ID field." range="27 - 16" rwaccess="RO"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x10" description="RTL revision.Will vary depending on release." range="15 - 11" rwaccess="RO"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x1" description="Majo revision." range="10 - 8" rwaccess="RO"/> 
		<bitfield id="REVCUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x1" description="Minor revision." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_CONFIGURATION" acronym="MPU_L2OCRAM_BANK3_CONFIGURATION" offset="0x4" width="32" description="">
		<bitfield id="ADDRESS_ALIGN" width="8" begin="31" end="24" resetval="0x0" description="Address alignment for range checking." range="31 - 24" rwaccess="RO"/> 
		<bitfield id="NUM_FIXED" width="4" begin="23" end="20" resetval="0x0" description="Number of fixed address ranges Configurable as 0 or 1." range="23 - 20" rwaccess="RO"/> 
		<bitfield id="NUM_PROG" width="4" begin="19" end="16" resetval="0x8" description="Number of programmable address ranges.Value is determined by configuration" range="19 - 16" rwaccess="RO"/> 
		<bitfield id="NUM_FIXED_AIDS" width="4" begin="15" end="12" resetval="0x0" description="Number of supported AIDs.0 = no specific AIDs supported (all treated equally)N = PrivIDs from 0 to N-1 supported, others use AIDX" range="15 - 12" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="11" begin="11" end="1" resetval="0x0" description="Always read as 0." range="11 - 1" rwaccess="RO"/> 
		<bitfield id="ASSUMED_ALLOWED" width="1" begin="0" end="0" resetval="0x0" description="Assumed allowed mode. 0 = assumed disallowed, 1 = assumed allowed" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_INTERRUPT_RAW_STATUSSET" acronym="MPU_L2OCRAM_BANK3_INTERRUPT_RAW_STATUSSET" offset="0x10" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0." range="31 - 2" rwaccess="RO"/> 
		<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read.Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="RW
	  			 W1TOSET"/> 
		<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="RW
	  			 W1TOSET"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_INTERRUPT_ENABLED_STATUSCLEAR" acronym="MPU_L2OCRAM_BANK3_INTERRUPT_ENABLED_STATUSCLEAR" offset="0x14" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0." range="31 - 2" rwaccess="RO"/> 
		<bitfield id="ENABLED_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Enabled status is read.Write a 1 to clear the status. Writing a 0 has no effect." range="1" rwaccess="RW
	  			 W0TOCLR"/> 
		<bitfield id="ENABLED_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="0" rwaccess="RW
	  			 W0TOCLR"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_INTERRUPT_ENABLE" acronym="MPU_L2OCRAM_BANK3_INTERRUPT_ENABLE" offset="0x18" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0." range="31 - 2" rwaccess="RO"/> 
		<bitfield id="ADDR_ERR_EN" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="1" rwaccess="RW
	  			 W1TOSET"/> 
		<bitfield id="PROT_ERR_EN" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="0" rwaccess="RW
	  			 W1TOSET"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_INTERRUPT_ENABLE_CLEAR" acronym="MPU_L2OCRAM_BANK3_INTERRUPT_ENABLE_CLEAR" offset="0x1C" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0." range="31 - 2" rwaccess="RO"/> 
		<bitfield id="ADDR_ERR_EN_CLR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to clear the enable. Writing a 0 has no effect." range="1" rwaccess="RW
	  			 W0TOCLR"/> 
		<bitfield id="PROT_ERR_EN_CLR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to clear the enable. Writing a 0 has no effect." range="0" rwaccess="RW
	  			 W0TOCLR"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_EOI" acronym="MPU_L2OCRAM_BANK3_EOI" offset="0x20" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Always read as 0." range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EOI_VECTOR" width="8" begin="7" end="0" resetval="0x0" description="EOI vector value.Write this with the interrupt distribution value in the chip. This drives the mpu_eoi_vector output signal." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_INTERRUPT_VECTOR" acronym="MPU_L2OCRAM_BANK3_INTERRUPT_VECTOR" offset="0x24" width="32" description="">
		<bitfield id="INTR_VEC" width="32" begin="31" end="0" resetval="0x0" description="Interrupt vector. Reads mpu_intr_vector input signal." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_FIXED_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_FIXED_START_ADDRESS" offset="0x100" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_FIXED_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_FIXED_END_ADDRESS" offset="0x104" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_FIXED_MPPA" acronym="MPU_L2OCRAM_BANK3_FIXED_MPPA" offset="0x108" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_1_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_1_START_ADDRESS" offset="0x200" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_1_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_1_END_ADDRESS" offset="0x204" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_1_MPPA" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_1_MPPA" offset="0x208" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Always read as 0." range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25 - 10" rwaccess="RW"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Non-secure permission. Defaults to input value." range="7" rwaccess="RW"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="RW"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="RW"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="RW"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="RW"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="RW"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="RW"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="RW"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_2_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_2_START_ADDRESS" offset="0x210" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_2_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_2_END_ADDRESS" offset="0x214" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
