IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MPU_L2OCRAM_BANK3_MPU_L2OCRAM_BANK3.xml
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_8_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_8_END_ADDRESS" offset="0x274" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_8_MPPA" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_8_MPPA" offset="0x278" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Always read as 0." range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25 - 10" rwaccess="RW"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Non-secure permission. Defaults to input value." range="7" rwaccess="RW"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="RW"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="RW"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="RW"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="RW"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="RW"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="RW"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="RW"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_9_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_9_START_ADDRESS" offset="0x280" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_9_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_9_END_ADDRESS" offset="0x284" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_9_MPPA" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_9_MPPA" offset="0x288" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_10_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_10_START_ADDRESS" offset="0x290" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_10_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_10_END_ADDRESS" offset="0x294" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_10_MPPA" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_10_MPPA" offset="0x298" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_11_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_11_START_ADDRESS" offset="0x2A0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_11_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_11_END_ADDRESS" offset="0x2A4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_11_MPPA" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_11_MPPA" offset="0x2A8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_12_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_12_START_ADDRESS" offset="0x2B0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_12_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_12_END_ADDRESS" offset="0x2B4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_12_MPPA" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_12_MPPA" offset="0x2B8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_13_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_13_START_ADDRESS" offset="0x2C0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_13_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_13_END_ADDRESS" offset="0x2C4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_13_MPPA" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_13_MPPA" offset="0x2C8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_14_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_14_START_ADDRESS" offset="0x2D0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_14_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_14_END_ADDRESS" offset="0x2D4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_14_MPPA" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_14_MPPA" offset="0x2D8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_15_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_15_START_ADDRESS" offset="0x2E0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_15_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_15_END_ADDRESS" offset="0x2E4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_15_MPPA" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_15_MPPA" offset="0x2E8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_16_START_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_16_START_ADDRESS" offset="0x2F0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_L2OCRAM_BANK3_PROGRAMMABLE_16_END_ADDRESS" acronym="MPU_L2OCRAM_BANK3_PROGRAMMABLE_16_END_ADDRESS" offset="0x2F4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
